chenyurong22/STM32F769i-DISCO/STM32F769I-DISCO-Config-LwIP-Socket-Server/Core/Src/custom_callback.c
/*
 * custom_callback.c
 *
 *  Created on: Jun 29, 2026
 *      Author: Debasish Das
 */
#include "custom_callback.h"
#include "stm32f7xx_hal.h"
#include  "custom.h"

#include "FreeRTOS.h"
#include "task.h"
#include "cmsis_os.h"


extern UART_HandleTypeDef huart1;
extern volatile uint8_t rxData;
extern volatile uint8_t rxBuffer[8];
extern volatile uint8_t count;

extern osThreadId NtpTimeEpochTasHandle;
extern TaskHandle_t Reset_DeviceHandle;

uint8_t complete = 0;

#define FREEROS 1


extern osThreadId NtpTimeReceiveHandle;
extern TaskHandle_t LwIPLinkHandle;
extern TaskHandle_t SNTP_LinkHandle;
extern TaskHandle_t UART_NtpTimeReceiveHandle;

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	BaseType_t xHighPriorityTaskWoken = pdFALSE;
	if(huart->Instance == USART1)
    {
		rxBuffer[count] = rxData;
		count++;

		if(count == 8)
		{
			count = 0;
			process_UART_Receive(rxBuffer, &xHighPriorityTaskWoken);

			portYIELD_FROM_ISR(xHighPriorityTaskWoken);
		}

        HAL_UART_Receive_IT(&huart1, &rxData, 1);
    }
}


void process_UART_Receive(const uint8_t *rxBuffer, BaseType_t *xHighPriorityTaskWoken)
{
	uint8_t aCmd = rxBuffer[0];

	switch(aCmd)
	{

	case 0xAA:
		vTaskNotifyGiveFromISR(UART_NtpTimeReceiveHandle, xHighPriorityTaskWoken);
		break;

	case 0x0C:
		vTaskNotifyGiveFromISR(LwIPLinkHandle, xHighPriorityTaskWoken);
		break;

	case 0x01:
		//writetoSerial(&huart1, "Mounting ..\r\n");
		vTaskNotifyGiveFromISR(MicroSD_mountHandle, xHighPriorityTaskWoken);
		break;

	case 0x02:
		//writetoSerial(&huart1, "Un-mounting ..\r\n");
		vTaskNotifyGiveFromISR(MicroSD_unmountHandle, xHighPriorityTaskWoken);
		break;

	case 0x03:
		//writetoSerial(&huart1, "Reading ..\r\n");
		vTaskNotifyGiveFromISR(MicroSD_readHandle, xHighPriorityTaskWoken);
		break;

	case 0x04:
		//writetoSerial(&huart1, "Writing ..\r\n");
		vTaskNotifyGiveFromISR(MicroSD_writeHandle, xHighPriorityTaskWoken);
		break;

	default:
		writetoSerial(&huart1, "Default ..\r\n");
		break;

	}
}

/**
  * @brief  EXTI line detection callbacks.
  * @param  GPIO_Pin Specifies the pins connected EXTI line
  * @retval None
  */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	BaseType_t xHigherPriorityTaskWoken = pdFALSE;

	if (GPIO_Pin == GPIO_PIN_0)
	{
		HAL_GPIO_TogglePin(GPIOJ, GPIO_PIN_5);

		vTaskNotifyGiveFromISR(Reset_DeviceHandle, &xHigherPriorityTaskWoken);

		portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
	}

}
